
clear 
close all


%   测试踩点的曲线拟合
%   轮廓下线拟合
A=[
2.99E+02	3.15E+00	7.92E+01
2.83E+02	1.68E+02	7.92E+01
1.55E+02	6.01E+02	7.92E+01
8.92E+01	6.15E+02	7.92E+01
2.78E+01	5.73E+02	7.92E+01
-2.07E+02	1.68E+02	7.92E+01
-2.98E+02	3.15E+00	7.92E+01


    ];

xa=A(:,1);ya=A(:,2);za=A(:,3);za=0;
fa=fit(xa,ya,'poly4');

plot(fa,xa,ya);hold on

%内轮廓
fa2=fa;
%------------------------
%   对fa2做改变
%------------------------

% fa2.p1=-fa2_pp(1)*1e-07;
% fa2.p2=-fa2_pp(2)*1e-04;
% fa2.p3=-fa2_pp(3)*0.1;


fa2.p5=fa2.p5-20;

plot(fa2)

plot([2,3,2],[3,4,5])
